<?php
$url = url('/');

return [
    'greeting' => "สวัสดี :PLACEHOLDER 😃\n\n ตั้งค่าการแจ้งเตือนสำเร็จ 🥳\n\nยินดีต้อนรับ!! 🍊",
    'regreeting' => "กลับมาทำไม ♩\n\nฉันลืมเธอไปหมดแล้ว ♪\n\nความหวังที่เคยเพริดแพรว ♫\n\nฉันลืมหมดแล้วไม่อยู่ในใจ ♬\n\n😒🍊",
    'user_not_verified' => "โปรดใส่รหัสยืนยันที่ได้จากระบบ Yuzu 🍊\n\nหากยังไม่เคยลงทะเบียนใช้งาน โปรดทำการลงทะเบียนก่อนที่ {$url} \n\n🤗",
    'invalid_verification_code' => "รหัสยืนยันไม่ถูกต้อง โปรดลองใหม่",
    'auto_reply' => 'bot นี้สำหรับแจ้งเตือนและฝากคำแนะนำการให้บริการเท่านั้น โปรดอย่าพิมพ์ข้อมูลส่วนบุคคลของท่าน เช่น HN วันเดือนปีเกิด หมายเลขโทรศัพท์ เลขบัตรประชาชน ส่งมาในแชทนี้\n\nหากท่านมีข้อสงสัยอื่นกรุณาติดต่อที่ ARI clinic โรงพยาบาลศิริราช 🍊',
    'calling_queue' => "ท่านอยู่ในคิวที่ใกล้ถึงเวลา swab\n\nกรุณามานั่งรอใน ARI clinic เพื่อฟังประกาศชื่อไปทำ swab"
];
